app/Controllers/PublicController.php

SELECT *
FROM `product`
---
  public function principal(){
    $data = [
      'title' => 'Principal',
      'breadcrumbs-items' => [
        ['title' => 'Principal', 'url' => '/principal']
      ],
      'productList' => $this->productoModel->findAll()
    ];